In [1]:
import pandas as pd

In [3]:
dataset=pd.DataFrame({'Stu_id':[1,2,3,4,5],
             'Gender':['Male','Female','Female','Male','Female'],
             'Region':['S','N','N','W','E']})

In [4]:
dataset

   Stu_id  Gender Region
0       1    Male      S
1       2  Female      N
2       3  Female      N
3       4    Male      W
4       5  Female      E

In [5]:
mapping = {'Male':0, 'Female':1, 'S':0, 'N':1, 'E':2, 'W':3}

In [6]:
cols = ['Gender','Region']

In [9]:
dataset[cols] = dataset[cols].applymap(mapping.get)

In [10]:
dataset

   Stu_id  Gender  Region
0       1       0       0
1       2       1       1
2       3       1       1
3       4       0       3
4       5       1       2